import cv2
import math

"""
    Встановити OpenCV, зчитати зображення з вебки, відобразити в першому віконці
    та записати його на диск. Після цього зчитати щойно записане зображення з диску,
    конвертувати у відтінки сірого та намалювати на ньому довільних кольорів лінію
    та прямокутник (наприклад червону лінію та синій прямокутник) і відобразити
    у другому віконці. Ні це не психотест, для дебагу це ще й як знадобиться. Бонуси
    за виконання цих кроків для відеоряду і бонуси до бонусів якщо в результаті цих
    кроків замість звалища картинок матимемо відеофайл (наприклад .avi).
"""

def capture_wideocam():

    cap = cv2.VideoCapture(0)
    ret, frame = cap.read() 
    
    cv2.imwrite("opencv_frame_img.png", frame)
    cv2.imshow('Press any key to close', frame) 
    cv2.waitKey(0)
    cv2.destroyAllWindows()
    cap.release()  


def draw_rectangle():
    pass


if __name__ == "__main__":
    capture_wideocam()